{
    "./pyscicalc/src/pyscicalc/__main__.py": [
        {
            "description": "This file acts as the designated entry point for the PySciCalc CLI application, enabling direct execution of the package. It ensures that the `main` function, which orchestrates the entire calculation process, is called when the script is run directly. The file's core component is the standard Python entry point idiom (`if __name__ == \"__main__\":`) that invokes the application's main routine. It internally depends on `src/pyscicalc/cli.py` to import and execute the `main` function. This file has no direct external dependencies; it only relies on internal modules of the PySciCalc project."
        }
    ],
    "./pyscicalc/src/pyscicalc/core/exceptions.py": [
        {
            "description": "This file defines custom exception classes, CalculationError and InvalidExpressionError, for the PySciCalc command-line interface application. It provides structured error types to differentiate between parsing issues and evaluation failures, improving error reporting to the user.\nCore Components: CalculationError (class), InvalidExpressionError (class).\nInternal Dependencies: This file is imported by src/pyscicalc/core/parser.py, src/pyscicalc/core/evaluator.py, and src/pyscicalc/cli.py.\nExternal Dependencies: None."
        }
    ],
    "./pyscicalc/src/pyscicalc/core/constants.py": [
        {
            "description": "This file defines common mathematical constants for the PySciCalc application. It exports a dictionary, CONSTANTS, mapping names like 'pi' and 'e' to their precise floating-point values from the math module. These constants are utilized by the expression evaluator to substitute constant names during calculations.\n\nCore Components: The file exports a dictionary named CONSTANTS, which holds floating-point values for mathematical constants such as 'pi' and 'e'.\nInternal Dependencies: This file is directly depended upon by src/pyscicalc/core/evaluator.py, which uses the CONSTANTS dictionary for substituting constant names during expression evaluation.\nExternal Dependencies: The file imports and utilizes the standard Python 'math' module to retrieve the values for Pi and Euler's number."
        }
    ],
    "./pyscicalc/src/pyscicalc/core/__init__.py": [
        {
            "description": "This `__init__.py` file defines the public interface for the `pyscicalc.core` package, making key components from its submodules directly accessible. It simplifies importing essential functions and exception classes for other parts of the application.\n\nCore Components: This file re-exports `CalculationError` and `InvalidExpressionError` (classes) for handling calculation-related and parsing-related exceptions, respectively. It also re-exports the `parse_expression` function responsible for converting infix expressions to RPN, and the `evaluate` function for computing the final result from RPN tokens.\n\nInternal Dependencies: This file imports directly from `src/pyscicalc/core/exceptions.py`, `src/pyscicalc/core/parser.py`, and `src/pyscicalc/core/evaluator.py`.\n\nExternal Dependencies: None."
        }
    ],
    "./pyscicalc/.gitignore": [
        {
            "description": "This .gitignore file specifies patterns for files and directories that Git should ignore in the PySciCalc project, preventing unnecessary or sensitive files from being committed to the repository. It includes common ignore rules for Python bytecode, virtual environments, build artifacts, IDE-specific files, test caches, temporary files, and Docker-related configurations.\nCore Components: The file's components are the various ignore patterns it defines, such as rules for __pycache__ directories, *.pyc files, build/ and dist/ directories, .venv/ and venv/ virtual environments, .idea/ and .vscode/ IDE configuration directories, .pytest_cache/, and common log or temporary files.\nInternal Dependencies: This file implicitly interacts with all files and directories within the project structure, acting as a configuration for what Git should not track. It doesn't import or directly use other project files.\nExternal Dependencies: The .gitignore file itself is a configuration for the Git version control system and does not have any external software or library dependencies beyond Git."
        }
    ],
    "./pyscicalc/src/pyscicalc/__init__.py": [
        {
            "description": "This `__init__.py` file serves as the main public interface for the `pyscicalc` package, streamlining access to its core functionalities. It aggregates and re-exports essential components like the expression parser, the evaluation engine, custom exception types, and definitions for mathematical constants and operations from its internal `core` sub-package. This structure allows other parts of the application or external users to easily import and utilize the calculator's main features directly from the `pyscicalc` package.\n\nCore Components: This file makes `parse_expression` (function), `evaluate` (function), `CalculationError` (class), `InvalidExpressionError` (class), `CONSTANTS` (dictionary), and `OPERATIONS` (dictionary) available as part of the `pyscicalc` package API.\n\nInternal Dependencies: This file imports from src/pyscicalc/core/parser.py, src/pyscicalc/core/evaluator.py, src/pyscicalc/core/exceptions.py, src/pyscicalc/core/constants.py, and src/pyscicalc/core/operations.py.\n\nExternal Dependencies: None."
        }
    ],
    "./pyscicalc/src/pyscicalc/cli.py": [
        {
            "description": "This file serves as the main command-line interface entry point for the PySciCalc application. It handles parsing user input expressions via command-line arguments, orchestrates the parsing and evaluation of these expressions, and displays the final result or relevant error messages to the console. The core component is the `main` function, which uses `argparse` to process arguments and integrates with the calculator's logic.\n\nCore Components: The `main` function orchestrates the application flow, specifically handling argument parsing and calling the expression processing logic. It utilizes an `ArgumentParser` instance for CLI argument management.\n\nInternal Dependencies: This file imports `parse_expression` from `src/pyscicalc/core/parser.py`, `evaluate` from `src/pyscicalc/core/evaluator.py`, and `InvalidExpressionError`, `CalculationError` from `src/pyscicalc/core/exceptions.py`.\n\nExternal Dependencies: It uses the built-in Python libraries `argparse` for command-line argument parsing and `sys` for system-specific parameters and functions, primarily for error output."
        }
    ],
    "./pyscicalc/requirements.txt": [
        {
            "description": "The `requirements.txt` file specifies external Python package dependencies for the PySciCalc project, ensuring consistent environment setup. As provided, its content indicates that the core application relies solely on the Python standard library, with no explicit third-party runtime dependencies declared in this file.\n\nThe primary \"component\" of this file is its declarative list of required external Python packages and their versions; currently, it specifies no external runtime libraries. This file acts as a project configuration and does not have internal code dependencies on other source files within the PySciCalc project. Based on the given content, this `requirements.txt` does not list any external third-party Python libraries for the application's runtime. While Pytest is part of the project's testing tech stack, it is not declared as a dependency in this file."
        }
    ],
    "./pyscicalc/src/pyscicalc/core/operations.py": [
        {
            "description": "This file defines the core mathematical operations and scientific functions for the PySciCalc application. It provides the implementation logic for various arithmetic, trigonometric, and logarithmic calculations, along with their respective precedence levels. The module acts as a central registry, allowing other components like the parser and evaluator to correctly interpret and execute mathematical expressions.\n\nCore Components: This file contains private functions such as _add, _subtract, _multiply, _divide, _power, _sin, _cos, _tan, _log_base10, _log_natural, and _exp, which encapsulate the mathematical logic. It also defines integer constants for operator precedence (PRECEDENCE_FUNCTIONS, PRECEDENCE_POWER, PRECEDENCE_MULT_DIV, PRECEDENCE_ADD_SUB) and exports the OPERATIONS dictionary, mapping operator symbols and function names to their precedence and callable implementations.\n\nInternal Dependencies: This module is a dependency for `src/pyscicalc/core/parser.py` (which uses `OPERATIONS` for operator precedence) and `src/pyscicalc/core/evaluator.py` (which uses `OPERATIONS` to execute the actual mathematical functions).\n\nExternal Dependencies: This file utilizes the standard Python `math` module for trigonometric, logarithmic, and exponential functions."
        }
    ],
    "./pyscicalc/README.md": [
        {
            "description": "The README.md file serves as the primary documentation for the PySciCalc command-line scientific calculator. It provides a comprehensive overview of the application's features, detailed instructions for installation and usage, examples of supported mathematical expressions, a breakdown of the project's internal structure, and information regarding testing, technologies, and contribution guidelines. It serves as the main informational guide for users and developers alike.\nCore Components: Overview of PySciCalc's arithmetic and scientific functions, input handling capabilities, step-by-step installation guide, usage examples for various calculations and error scenarios, a detailed project structure breakdown, instructions for running Pytest, and a list of core technologies used.\nInternal Dependencies: This file references and documents the entire PySciCalc project structure including `src/pyscicalc/__main__.py`, `src/pyscicalc/cli.py`, and the `src/pyscicalc/core` modules (`constants.py`, `evaluator.py`, `exceptions.py`, `operations.py`, `parser.py`). It also explicitly mentions `requirements.txt` for dependencies and `LICENSE` for licensing information.\nExternal Dependencies: The project described in this README depends on Python 3.8+, Argparse for CLI argument parsing, and Pytest for testing. Git is also a prerequisite mentioned for cloning the repository."
        }
    ],
    "./pyscicalc/src/pyscicalc/core/evaluator.py": [
        {
            "description": "This file implements the core logic for evaluating mathematical expressions, specifically processing a list of tokens in Reverse Polish Notation (RPN). Its primary function, `evaluate`, manages a stack to perform arithmetic and scientific operations, ultimately yielding a single numerical result. It integrates dictionaries of operations and constants, and raises `CalculationError` for issues like division by zero or insufficient operands. The core components include the `evaluate` function and internal sets `BINARY_OPERATORS` and `UNARY_FUNCTIONS`. It internally depends on `operations.py` for operation definitions, `constants.py` for mathematical constants, and `exceptions.py` for custom error handling. There are no direct external library dependencies; it relies on standard Python functionality."
        }
    ],
    "./pyscicalc/src/pyscicalc/core/parser.py": [
        {
            "description": "This file, parser.py, is responsible for converting an infix mathematical expression string into a postfix (Reverse Polish Notation or RPN) token stream. It acts as the lexical analyzer and parser for the PySciCalc application, preparing expressions for evaluation by the evaluator component. The file contains the main parse_expression function, along with helper functions for tokenization, operator precedence, and associativity. It leverages the tokenize function to break down the input string into individual tokens, identifies numbers, operators, functions, and constants, and then applies the Shunting-yard algorithm to transform the token stream into RPN. It uses `re` for regular expression matching during tokenization and `collections.deque` for efficient queue and stack operations during parsing. Internally, it depends on `src/pyscicalc/core/constants.py` for recognizing constants, `src/pyscicalc/core/operations.py` for operator precedence and function names, and `src/pyscicalc/core/exceptions.py` for custom error handling with `InvalidExpressionError`."
        }
    ]
}